/* automatically generated by rust-bindgen 0.68.1 */

pub const SVBCAMERA_ID_MAX: u32 = 128;
pub const SVB_BAYER_PATTERN_SVB_BAYER_RG: SVB_BAYER_PATTERN = 0;
pub const SVB_BAYER_PATTERN_SVB_BAYER_BG: SVB_BAYER_PATTERN = 1;
pub const SVB_BAYER_PATTERN_SVB_BAYER_GR: SVB_BAYER_PATTERN = 2;
pub const SVB_BAYER_PATTERN_SVB_BAYER_GB: SVB_BAYER_PATTERN = 3;
pub type SVB_BAYER_PATTERN = ::std::os::raw::c_uint;
pub const SVB_IMG_TYPE_SVB_IMG_RAW8: SVB_IMG_TYPE = 0;
pub const SVB_IMG_TYPE_SVB_IMG_RAW10: SVB_IMG_TYPE = 1;
pub const SVB_IMG_TYPE_SVB_IMG_RAW12: SVB_IMG_TYPE = 2;
pub const SVB_IMG_TYPE_SVB_IMG_RAW14: SVB_IMG_TYPE = 3;
pub const SVB_IMG_TYPE_SVB_IMG_RAW16: SVB_IMG_TYPE = 4;
pub const SVB_IMG_TYPE_SVB_IMG_Y8: SVB_IMG_TYPE = 5;
pub const SVB_IMG_TYPE_SVB_IMG_Y10: SVB_IMG_TYPE = 6;
pub const SVB_IMG_TYPE_SVB_IMG_Y12: SVB_IMG_TYPE = 7;
pub const SVB_IMG_TYPE_SVB_IMG_Y14: SVB_IMG_TYPE = 8;
pub const SVB_IMG_TYPE_SVB_IMG_Y16: SVB_IMG_TYPE = 9;
pub const SVB_IMG_TYPE_SVB_IMG_RGB24: SVB_IMG_TYPE = 10;
pub const SVB_IMG_TYPE_SVB_IMG_RGB32: SVB_IMG_TYPE = 11;
pub const SVB_IMG_TYPE_SVB_IMG_END: SVB_IMG_TYPE = -1;
pub type SVB_IMG_TYPE = ::std::os::raw::c_int;
pub const SVB_GUIDE_DIRECTION_SVB_GUIDE_NORTH: SVB_GUIDE_DIRECTION = 0;
pub const SVB_GUIDE_DIRECTION_SVB_GUIDE_SOUTH: SVB_GUIDE_DIRECTION = 1;
pub const SVB_GUIDE_DIRECTION_SVB_GUIDE_EAST: SVB_GUIDE_DIRECTION = 2;
pub const SVB_GUIDE_DIRECTION_SVB_GUIDE_WEST: SVB_GUIDE_DIRECTION = 3;

pub const SVB_CAMERA_MODE_SVB_MODE_TRIG_RISE_EDGE: SVB_CAMERA_MODE = 2;
pub const SVB_CAMERA_MODE_SVB_MODE_TRIG_FALL_EDGE: SVB_CAMERA_MODE = 3;
pub const SVB_CAMERA_MODE_SVB_MODE_TRIG_DOUBLE_EDGE: SVB_CAMERA_MODE = 4;
pub const SVB_CAMERA_MODE_SVB_MODE_TRIG_HIGH_LEVEL: SVB_CAMERA_MODE = 5;
pub const SVB_CAMERA_MODE_SVB_MODE_TRIG_LOW_LEVEL: SVB_CAMERA_MODE = 6;
pub const SVB_CAMERA_MODE_SVB_MODE_END: SVB_CAMERA_MODE = -1;
pub type SVB_CAMERA_MODE = ::std::os::raw::c_int;
pub const SVB_TRIG_OUTPUT_SVB_TRIG_OUTPUT_PINA: SVB_TRIG_OUTPUT = 0;
pub const SVB_TRIG_OUTPUT_SVB_TRIG_OUTPUT_PINB: SVB_TRIG_OUTPUT = 1;
pub const SVB_TRIG_OUTPUT_SVB_TRIG_OUTPUT_NONE: SVB_TRIG_OUTPUT = -1;
pub type SVB_TRIG_OUTPUT = ::std::os::raw::c_int;
pub use self::SVB_TRIG_OUTPUT as SVB_TRIG_OUTPUT_PIN;
pub const SVB_ERROR_CODE_SVB_SUCCESS: SVB_ERROR_CODE = 0;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_INDEX: SVB_ERROR_CODE = 1;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_ID: SVB_ERROR_CODE = 2;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_CONTROL_TYPE: SVB_ERROR_CODE = 3;
pub const SVB_ERROR_CODE_SVB_ERROR_CAMERA_CLOSED: SVB_ERROR_CODE = 4;
pub const SVB_ERROR_CODE_SVB_ERROR_CAMERA_REMOVED: SVB_ERROR_CODE = 5;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_PATH: SVB_ERROR_CODE = 6;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_FILEFORMAT: SVB_ERROR_CODE = 7;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_SIZE: SVB_ERROR_CODE = 8;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_IMGTYPE: SVB_ERROR_CODE = 9;
pub const SVB_ERROR_CODE_SVB_ERROR_OUTOF_BOUNDARY: SVB_ERROR_CODE = 10;
pub const SVB_ERROR_CODE_SVB_ERROR_TIMEOUT: SVB_ERROR_CODE = 11;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_SEQUENCE: SVB_ERROR_CODE = 12;
pub const SVB_ERROR_CODE_SVB_ERROR_BUFFER_TOO_SMALL: SVB_ERROR_CODE = 13;
pub const SVB_ERROR_CODE_SVB_ERROR_VIDEO_MODE_ACTIVE: SVB_ERROR_CODE = 14;
pub const SVB_ERROR_CODE_SVB_ERROR_EXPOSURE_IN_PROGRESS: SVB_ERROR_CODE = 15;
pub const SVB_ERROR_CODE_SVB_ERROR_GENERAL_ERROR: SVB_ERROR_CODE = 16;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_MODE: SVB_ERROR_CODE = 17;
pub const SVB_ERROR_CODE_SVB_ERROR_INVALID_DIRECTION: SVB_ERROR_CODE = 18;
pub const SVB_ERROR_CODE_SVB_ERROR_UNKNOW_SENSOR_TYPE: SVB_ERROR_CODE = 19;
pub const SVB_ERROR_CODE_SVB_ERROR_END: SVB_ERROR_CODE = 20;
pub type SVB_ERROR_CODE = ::std::os::raw::c_uint;
pub const SVB_BOOL_SVB_FALSE: SVB_BOOL = 0;
pub const SVB_BOOL_SVB_TRUE: SVB_BOOL = 1;
pub type SVB_BOOL = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SVB_CAMERA_INFO {
    pub FriendlyName: [::std::os::raw::c_char; 32usize],
    pub CameraSN: [::std::os::raw::c_char; 32usize],
    pub PortType: [::std::os::raw::c_char; 32usize],
    pub DeviceID: ::std::os::raw::c_uint,
    pub CameraID: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SVB_CAMERA_INFO() {
    const UNINIT: ::std::mem::MaybeUninit<SVB_CAMERA_INFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SVB_CAMERA_INFO>(),
        104usize,
        concat!("Size of: ", stringify!(SVB_CAMERA_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<SVB_CAMERA_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(SVB_CAMERA_INFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FriendlyName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_INFO),
            "::",
            stringify!(FriendlyName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CameraSN) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_INFO),
            "::",
            stringify!(CameraSN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PortType) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_INFO),
            "::",
            stringify!(PortType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeviceID) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_INFO),
            "::",
            stringify!(DeviceID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CameraID) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_INFO),
            "::",
            stringify!(CameraID)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SVB_CAMERA_PROPERTY {
    pub MaxHeight: ::std::os::raw::c_long,
    pub MaxWidth: ::std::os::raw::c_long,
    pub IsColorCam: SVB_BOOL,
    pub BayerPattern: SVB_BAYER_PATTERN,
    pub SupportedBins: [::std::os::raw::c_int; 16usize],
    pub SupportedVideoFormat: [SVB_IMG_TYPE; 8usize],
    pub MaxBitDepth: ::std::os::raw::c_int,
    pub IsTriggerCam: SVB_BOOL,
}
#[test]
fn bindgen_test_layout_SVB_CAMERA_PROPERTY() {
    const UNINIT: ::std::mem::MaybeUninit<SVB_CAMERA_PROPERTY> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SVB_CAMERA_PROPERTY>(),
        128usize,
        concat!("Size of: ", stringify!(SVB_CAMERA_PROPERTY))
    );
    assert_eq!(
        ::std::mem::align_of::<SVB_CAMERA_PROPERTY>(),
        8usize,
        concat!("Alignment of ", stringify!(SVB_CAMERA_PROPERTY))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxHeight) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(MaxHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxWidth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(MaxWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsColorCam) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(IsColorCam)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BayerPattern) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(BayerPattern)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedBins) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(SupportedBins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedVideoFormat) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(SupportedVideoFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxBitDepth) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(MaxBitDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsTriggerCam) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY),
            "::",
            stringify!(IsTriggerCam)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SVB_CAMERA_PROPERTY_EX {
    pub bSupportPulseGuide: SVB_BOOL,
    pub bSupportControlTemp: SVB_BOOL,
    pub Unused: [::std::os::raw::c_int; 64usize],
}
#[test]
fn bindgen_test_layout_SVB_CAMERA_PROPERTY_EX() {
    const UNINIT: ::std::mem::MaybeUninit<SVB_CAMERA_PROPERTY_EX> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SVB_CAMERA_PROPERTY_EX>(),
        264usize,
        concat!("Size of: ", stringify!(SVB_CAMERA_PROPERTY_EX))
    );
    assert_eq!(
        ::std::mem::align_of::<SVB_CAMERA_PROPERTY_EX>(),
        4usize,
        concat!("Alignment of ", stringify!(SVB_CAMERA_PROPERTY_EX))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSupportPulseGuide) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY_EX),
            "::",
            stringify!(bSupportPulseGuide)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSupportControlTemp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY_EX),
            "::",
            stringify!(bSupportControlTemp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Unused) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SVB_CAMERA_PROPERTY_EX),
            "::",
            stringify!(Unused)
        )
    );
}
pub const SVB_CONTROL_TYPE_SVB_GAIN: SVB_CONTROL_TYPE = 0;
pub const SVB_CONTROL_TYPE_SVB_EXPOSURE: SVB_CONTROL_TYPE = 1;
pub const SVB_CONTROL_TYPE_SVB_GAMMA: SVB_CONTROL_TYPE = 2;
pub const SVB_CONTROL_TYPE_SVB_GAMMA_CONTRAST: SVB_CONTROL_TYPE = 3;
pub const SVB_CONTROL_TYPE_SVB_WB_R: SVB_CONTROL_TYPE = 4;
pub const SVB_CONTROL_TYPE_SVB_WB_G: SVB_CONTROL_TYPE = 5;
pub const SVB_CONTROL_TYPE_SVB_WB_B: SVB_CONTROL_TYPE = 6;
pub const SVB_CONTROL_TYPE_SVB_FLIP: SVB_CONTROL_TYPE = 7;
pub const SVB_CONTROL_TYPE_SVB_FRAME_SPEED_MODE: SVB_CONTROL_TYPE = 8;
pub const SVB_CONTROL_TYPE_SVB_CONTRAST: SVB_CONTROL_TYPE = 9;
pub const SVB_CONTROL_TYPE_SVB_SHARPNESS: SVB_CONTROL_TYPE = 10;
pub const SVB_CONTROL_TYPE_SVB_SATURATION: SVB_CONTROL_TYPE = 11;
pub const SVB_CONTROL_TYPE_SVB_AUTO_TARGET_BRIGHTNESS: SVB_CONTROL_TYPE = 12;
pub const SVB_CONTROL_TYPE_SVB_BLACK_LEVEL: SVB_CONTROL_TYPE = 13;
pub const SVB_CONTROL_TYPE_SVB_COOLER_ENABLE: SVB_CONTROL_TYPE = 14;
pub const SVB_CONTROL_TYPE_SVB_TARGET_TEMPERATURE: SVB_CONTROL_TYPE = 15;
pub const SVB_CONTROL_TYPE_SVB_CURRENT_TEMPERATURE: SVB_CONTROL_TYPE = 16;
pub const SVB_CONTROL_TYPE_SVB_COOLER_POWER: SVB_CONTROL_TYPE = 17;
pub const SVB_CONTROL_TYPE_SVB_BAD_PIXEL_CORRECTION_ENABLE: SVB_CONTROL_TYPE = 18;
pub type SVB_CONTROL_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SVB_CONTROL_CAPS {
    pub Name: [::std::os::raw::c_char; 64usize],
    pub Description: [::std::os::raw::c_char; 128usize],
    pub MaxValue: ::std::os::raw::c_long,
    pub MinValue: ::std::os::raw::c_long,
    pub DefaultValue: ::std::os::raw::c_long,
    pub IsAutoSupported: SVB_BOOL,
    pub IsWritable: SVB_BOOL,
    pub ControlType: SVB_CONTROL_TYPE,
    pub Unused: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout__SVB_CONTROL_CAPS() {
    const UNINIT: ::std::mem::MaybeUninit<_SVB_CONTROL_CAPS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SVB_CONTROL_CAPS>(),
        264usize,
        concat!("Size of: ", stringify!(_SVB_CONTROL_CAPS))
    );
    assert_eq!(
        ::std::mem::align_of::<_SVB_CONTROL_CAPS>(),
        8usize,
        concat!("Alignment of ", stringify!(_SVB_CONTROL_CAPS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Description) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(Description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxValue) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(MaxValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinValue) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(MinValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultValue) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(DefaultValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAutoSupported) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(IsAutoSupported)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsWritable) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(IsWritable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ControlType) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(ControlType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Unused) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_CONTROL_CAPS),
            "::",
            stringify!(Unused)
        )
    );
}
pub type SVB_CONTROL_CAPS = _SVB_CONTROL_CAPS;
pub const SVB_EXPOSURE_STATUS_SVB_EXP_IDLE: SVB_EXPOSURE_STATUS = 0;
pub const SVB_EXPOSURE_STATUS_SVB_EXP_WORKING: SVB_EXPOSURE_STATUS = 1;
pub const SVB_EXPOSURE_STATUS_SVB_EXP_SUCCESS: SVB_EXPOSURE_STATUS = 2;
pub const SVB_EXPOSURE_STATUS_SVB_EXP_FAILED: SVB_EXPOSURE_STATUS = 3;
pub type SVB_EXPOSURE_STATUS = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SVB_ID {
    pub id: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout__SVB_ID() {
    const UNINIT: ::std::mem::MaybeUninit<_SVB_ID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SVB_ID>(),
        64usize,
        concat!("Size of: ", stringify!(_SVB_ID))
    );
    assert_eq!(
        ::std::mem::align_of::<_SVB_ID>(),
        1usize,
        concat!("Alignment of ", stringify!(_SVB_ID))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_ID),
            "::",
            stringify!(id)
        )
    );
}
pub type SVB_ID = _SVB_ID;
pub type SVB_SN = SVB_ID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SVB_SUPPORTED_MODE {
    pub SupportedCameraMode: [SVB_CAMERA_MODE; 16usize],
}
#[test]
fn bindgen_test_layout__SVB_SUPPORTED_MODE() {
    const UNINIT: ::std::mem::MaybeUninit<_SVB_SUPPORTED_MODE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SVB_SUPPORTED_MODE>(),
        64usize,
        concat!("Size of: ", stringify!(_SVB_SUPPORTED_MODE))
    );
    assert_eq!(
        ::std::mem::align_of::<_SVB_SUPPORTED_MODE>(),
        4usize,
        concat!("Alignment of ", stringify!(_SVB_SUPPORTED_MODE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SupportedCameraMode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SVB_SUPPORTED_MODE),
            "::",
            stringify!(SupportedCameraMode)
        )
    );
}
pub type SVB_SUPPORTED_MODE = _SVB_SUPPORTED_MODE;
extern "C" {
    #[doc = "Descriptions:\nthis should be the first API to be called\nget number of connected SVB cameras,\n\nParas:\n\nreturn:number of connected SVB cameras. 1 means 1 camera connected."]
    pub fn SVBGetNumOfConnectedCameras() -> ::std::os::raw::c_int;
}
extern "C" {
